user-4.1/tutorials/multiPhysics/interTrackEddyCurrentFoam/rgs2D_Coarse/0.org/region_fluid/pB
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  | For copyright notice see file Copyright         |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      pB;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    frontAndBack
    {
        type            empty;
    }
    trackedSurface
    {
        type            calculated;
        value           $internalField;
    }
    movingWall
    {
        type            calculated;
        value           $internalField;
    }
    fixedWall
    {
        type            calculated;
        value           $internalField;
    }
    "procBoundary.*"
    {
        type            processor;
        value           $internalField;
    }
}

// ************************************************************************* //
