user-4.1/tutorials/multiPhysics/interTrackEddyCurrentFoam/rgs2D_Coarse/constant/region_fluid/faMesh.org/faMeshDefinition
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  | For copyright notice see file Copyright         |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      faMeshDefinition;
}
// ************************************************************************** //

polyMeshPatches               1(trackedSurface);

boundary
{
    fixedWall
    {
        type                  patch;
        ownerPolyPatch        trackedSurface;
        neighbourPolyPatch    fixedWall;
    }

    frontAndBack
    {
        type                  empty;
        ownerPolyPatch        trackedSurface;
        neighbourPolyPatch    frontAndBack;
    }
}

// ************************************************************************** //
